tap "boz/repo"
tap "filippo.io/age", "https://filippo.io/age"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jez/formulae"
tap "johanhaleby/kubetail"
tap "koekeishiya/formulae"
tap "sachaos/tap"
tap "tilt-dev/tap"
# Simple, modern, secure file encryption
brew "age"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Asynchronous DNS library
brew "c-ares"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Perl compatible regular expressions library
brew "pcre"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# X.Org: pthread-stubs.pc
brew "libpthread-stubs"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Securely send things from one computer to another
brew "croc"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Asynchronous event library
brew "libev"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# C library implementing the SSH2 protocol
brew "libssh2"
# HTTP/2 C Library
brew "nghttp2"
# Open source suite of directory software
brew "openldap"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Standard SGML representation system for technical documents
brew "docbook"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Friendly and expressive shell
brew "elvish"
# Cloud-native high-performance edge/middle/service proxy
brew "envoy"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Minimalistic plugin API for video effects
brew "frei0r"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Library and utilities for processing GIFs
brew "giflib"
# GNU multiple precision arithmetic library
brew "gmp"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Asynchronous event library
brew "libevent"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# Image manipulation library
brew "jpeg"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Audio codec
brew "opus"
# C library for files containing sampled sound
brew "libsndfile"
# Library for sample rate conversion of audio data
brew "libsamplerate"
# NaCl networking and cryptography library
brew "libsodium"
# High quality, one-dimensional sample-rate conversion library
brew "libsoxr"
# Transcode video stabilization plugin
brew "libvidstab"
# VP8/VP9 video codec
brew "libvpx"
# Audio codecs extracted from Android open source project
brew "opencore-amr"
# Fastest and safest AV1 video encoder
brew "rav1e"
# Audio time stretcher tool and library
brew "rubberband"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Compression/decompression library aiming for high speed
brew "snappy"
# Audio codec designed for speech
brew "speex"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Open video compression format
brew "theora"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# High-performance, asynchronous messaging library
brew "zeromq"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Text-based UI library
brew "ncurses"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish", args: ["HEAD"]
# Command-line fuzzy finder written in Go
brew "fzf"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# Easily access your Google Calendar(s) from a command-line
brew "gcalcli"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# International domain name library
brew "libidn"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Command-line option parsing utility
brew "gnu-getopt"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Toolkit for embedding hypervisor capabilities in your application
brew "hyperkit"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# Open h.265 video codec implementation
brew "libde265"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# LLVM's OpenMP runtime library
brew "libomp"
# High dynamic-range image file format
brew "openexr"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Istio configuration command-line utility
brew "istioctl"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# DNS library written in C
brew "ldns"
# Secure hashing function
brew "libb2"
# Extremely Fast Compression algorithm
brew "lz4"
# Multi-format archive and compression library
brew "libarchive"
# CBOR protocol implementation for C and others
brew "libcbor"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# General purpose TCP-IP emulator
brew "libslirp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C virtualization API
brew "libvirt", restart_service: true
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# C websockets server library
brew "libwebsockets"
# YAML Parser
brew "libyaml"
# Ethernet compliant virtual network
brew "vde"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Powerful, lightweight programming language
brew "lua"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv"
# Run a Kubernetes cluster locally
brew "minikube"
# Embeddable Javascript interpreter
brew "mujs"
# Encoding detector library
brew "uchardet"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"], link: false
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Trigger notifications when a process completes
brew "noti"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Show ps output as a tree
brew "pstree"
# Command-line tool for managing long-running shell commands
brew "pueue", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Soak up standard input and write to a file
brew "sponge"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Open source continuous file synchronization application
brew "syncthing"
# User interface to the TELNET protocol
brew "telnet"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Terminal multiplexer
brew "tmux", args: ["HEAD"]
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Ncurses based file manager with vi like keybindings
brew "vifm", args: ["HEAD"]
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# kubernetes tail - pod log viewer
brew "boz/repo/kail"
# Convert Pandoc Markdown-style footnotes into sidenotes
brew "jez/formulae/pandoc-sidenote"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd", args: ["with-logging"]
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Modern waach command. Viddy well, gopher. Viddy well.
brew "sachaos/tap/viddy"
# Making local Kubernetes clusters easy to set up and tear down
brew "tilt-dev/tap/ctlptl"
# Tilt powers multi-service developments for teams that deploy to Kubernetes.
brew "tilt-dev/tap/tilt"
# GPU-accelerated terminal emulator
cask "alacritty"
# Android SDK component
cask "android-platform-tools"
# Clipboard manager with advanced features
cask "copyq"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Git client
cask "sublime-merge"
# Terminal emulator, SSH and serial client
cask "tabby"
# Messaging app with a focus on speed and security
cask "telegram"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Web browser focusing on customization and control
cask "vivaldi"
# Network protocol analyzer
cask "wireshark"
