tap "blacknon/hwatch"
tap "boz/repo"
tap "brandonskerritt/rustscan"
tap "bufbuild/buf"
tap "charmbracelet/tap"
tap "cloudflare/cloudflare"
tap "filippo.io/age", "https://filippo.io/age"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jez/formulae"
tap "johanhaleby/kubetail"
tap "koekeishiya/formulae"
tap "sachaos/tap"
tap "tilt-dev/tap"
tap "wez/wezterm"
tap "wvanlint/twf"
# Run your GitHub Actions locally 🚀
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Library and utilities for processing GIFs
brew "giflib"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# Image manipulation library
brew "jpeg"
# Library for manipulating PNG images
brew "libpng"
# TIFF library and utilities
brew "libtiff"
# High dynamic-range image file format
brew "openexr"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# GNU database manager
brew "gdbm"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Record and share terminal sessions
brew "asciinema"
# Archival front-end
brew "atool"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Garbage collector for C and C++
brew "bdw-gc"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Manage compile and link flags for libraries
brew "pkg-config"
# X.Org: pthread-stubs.pc
brew "libpthread-stubs"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# New way to see and navigate directory trees
brew "broot"
# Asynchronous DNS library
brew "c-ares"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Portable Foreign Function Interface library
brew "libffi"
# Perl compatible regular expressions library
brew "pcre"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Object-file caching compiler wrapper
brew "ccache"
# Generic library support script
brew "libtool"
# CloudFlare's PKI toolkit
brew "cfssl"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU multiple precision arithmetic library
brew "gmp"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# General purpose TCP-IP emulator
brew "libslirp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Library for USB device access
brew "libusb"
# Text-based UI library
brew "ncurses"
# Compression/decompression library aiming for high speed
brew "snappy"
# Ethernet compliant virtual network
brew "vde"
# Emulator for x86 and PowerPC
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS with minimal setup
brew "colima", args: ["HEAD"]
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Securely send things from one computer to another
brew "croc"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Open source suite of directory software
brew "openldap"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# LCS based diff highlighting tool to ease code review from your terminal
brew "diffr"
# Minimal, fast alternative to 'du -sh'
brew "diskus"
# Tool for exploring each layer in a docker image
brew "dive"
# Standard SGML representation system for technical documents
brew "docbook"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line DNS client
brew "dog"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Run arbitrary commands when files change
brew "entr"
# Cloud-native high-performance edge/middle/service proxy
brew "envoy"
# Modern replacement for 'ls'
brew "exa"
# XML 1.0 parser
brew "expat"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Minimalistic plugin API for video effects
brew "frei0r"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# OpenType text shaping engine
brew "harfbuzz"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Audio codec
brew "opus"
# C library for files containing sampled sound
brew "libsndfile"
# Library for sample rate conversion of audio data
brew "libsamplerate"
# NaCl networking and cryptography library
brew "libsodium"
# High quality, one-dimensional sample-rate conversion library
brew "libsoxr"
# Transcode video stabilization plugin
brew "libvidstab"
# VP8/VP9 video codec
brew "libvpx"
# Audio codecs extracted from Android open source project
brew "opencore-amr"
# Fastest and safest AV1 video encoder
brew "rav1e"
# Audio time stretcher tool and library
brew "rubberband"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Audio codec designed for speech
brew "speex"
# Secure Reliable Transport
brew "srt"
# Secure hashing function
brew "libb2"
# Extremely Fast Compression algorithm
brew "lz4"
# Multi-format archive and compression library
brew "libarchive"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Open video compression format
brew "theora"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# High-performance, asynchronous messaging library
brew "zeromq"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish", args: ["HEAD"]
# Fast and Lightweight Logs and Metrics processor
brew "fluent-bit"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf", args: ["HEAD"], link: false
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy", args: ["HEAD"]
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# Easily access your Google Calendar(s) from a command-line
brew "gcalcli"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh", link: false
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# International domain name library
brew "libidn"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Powerful, lightweight programming language
brew "lua"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Make JSON greppable
brew "gron"
# Kubernetes package manager
brew "helm"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Asynchronous event library
brew "libev"
# Toolkit for embedding hypervisor capabilities in your application
brew "hyperkit"
# Open h.265 video codec implementation
brew "libde265"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# LLVM's OpenMP runtime library
brew "libomp"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Peer-to-peer hypermedia protocol
brew "ipfs"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Istio configuration command-line utility
brew "istioctl"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Fast, Dynamic Programming Language
brew "julia"
# Handy way to save and run project-specific commands
brew "just"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Open-source distributed event streaming platform
brew "kafka"
# Selection-based modal text editor
brew "kakoune"
# Run local Kubernetes cluster in Docker
brew "kind"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# DNS library written in C
brew "ldns"
# CBOR protocol implementation for C and others
brew "libcbor"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Postgres C API library
brew "libpq"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C virtualization API
brew "libvirt"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# C websockets server library
brew "libwebsockets"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv"
# Create modern online books from Markdown files
brew "mdbook"
# Run a Kubernetes cluster locally
brew "minikube"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Embeddable Javascript interpreter
brew "mujs"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Open source relational database management system
brew "mysql"
# NCurses Disk Usage
brew "ncdu"
# Thread-based email index, search, and tagging
brew "notmuch"
# E-mail reader with support for Notmuch, NNTP and much more
brew "neomutt"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node"
# Prometheus exporter for machine metrics
brew "node_exporter"
# Trigger notifications when a process completes
brew "noti"
# Libraries for security-enabled client and server applications
brew "nss"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Highly capable, feature-rich programming language
brew "perl"
# Copy/paste anything over the network
brew "piknik"
# Paste PNG into files
brew "pngpaste"
# Object-relational database system
brew "postgresql"
# OpenBSD and Darwin versions of pgrep, pkill, and pfind
brew "proctools"
# Service monitoring system and time series database
brew "prometheus"
# Show ps output as a tree
brew "pstree"
# Command-line tool for managing long-running shell commands
brew "pueue", restart_service: true
# Perl 6 compiler targeting MoarVM
brew "rakudo"
# Unified tool to manage your Rancher server
brew "rancher-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Modern Day Portscanner
brew "rustscan"
# Rust toolchain installer
brew "rustup-init"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Display and control your Android device
brew "scrcpy"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Fuzzy Finder in rust!
brew "sk"
# SOcket CAT: netcat on steroids
brew "socat"
# Editor of encrypted files
brew "sops"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Soak up standard input and write to a file
brew "sponge", link: false
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Open source continuous file synchronization application
brew "syncthing"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Encoding detector library
brew "uchardet"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Visual Binary Diff
brew "vbindiff"
# Ncurses-based file manager with vi-like keybindings
brew "vifm"
# Manage the desktop wallpaper
brew "wallpaper"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# General-purpose lossless data-compression library
brew "zlib"
# alternative watch command
brew "blacknon/hwatch/hwatch"
# A new way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# A personal key value store
brew "charmbracelet/tap/skate"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
# Flux CLI
brew "fluxcd/tap/flux"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Convert Pandoc Markdown-style footnotes into sidenotes
brew "jez/formulae/pandoc-sidenote"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Modern waach command. Viddy well, gopher. Viddy well.
brew "sachaos/tap/viddy"
# Making local Kubernetes clusters easy to set up and tear down
brew "tilt-dev/tap/ctlptl"
# A dev environment as code for microservice apps
brew "tilt-dev/tap/tilt"
# Standalone tree view file explorer, inspired by fzf
brew "wvanlint/twf/twf", args: ["HEAD"]
# Application launcher and productivity software
cask "alfred"
# Android SDK component
cask "android-platform-tools"
# Web browser focusing on privacy
cask "brave-browser"
# Free and open-source web browser
cask "chromium"
# Clipboard manager with advanced features
cask "copyq"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customizer
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Minimal browser that protects privacy
cask "min"
# Media player based on MPlayer and mplayer2
cask "mpv"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Git client
cask "sublime-merge"
# Terminal emulator, SSH and serial client
cask "tabby"
# Messaging app with a focus on speed and security
cask "telegram"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Web browser focusing on customization and control
cask "vivaldi"
# A GPU-accelerated cross-platform terminal emulator and multiplexer written by @wez and implemented in Rust
cask "wezterm-nightly"
# Network protocol analyzer
cask "wireshark"
# Remote desktop software
cask "x2goclient"
