aalib
aarch64-linux-gnu-binutils
aarch64-linux-gnu-gcc
aarch64-linux-gnu-glibc
aarch64-linux-gnu-linux-api-headers
acl
adobe-source-code-pro-fonts
adwaita-icon-theme
alacritty
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
aom
apache
apr
apr-util
arandr
archlinux-keyring
argon2
aria2
at-spi2-atk
at-spi2-core
atk
atool
attr
audit
autoconf
autoconf-archive
automake
autorandr
avahi
aws-cli
base
bash
bcg729
bind
binutils
bison
bluez
bluez-libs
bluez-utils
boost-libs
bridge-utils
brotli
bspwm
btrfs-progs
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cantarell-fonts
capstone
cdparanoia
cifs-utils
clang
clucene
cmake
colord
compiler-rt
confuse
containerd
convmv
copyq
coreutils
cracklib
cronie
cryptsetup
ctags
curl
dav1d
db
dbeaver
dbus
dbus-glib
dconf
debtap
desktop-file-utils
device-mapper
dhcpcd
dialog
diff-so-fancy
diffutils
diskus
djvulibre
dkms
dmenu
dmraid
dnssec-anchors
docker
dosfstools
dotnet-host
dotnet-runtime
dotnet-sdk
dotnet-targeting-pack
double-conversion
dunst
e2fsprogs
efivar
elfutils
enchant
entr
espeak
exa
expat
fail2ban
fakeroot
faudio
fcitx
fcitx-configtool
fcitx-hangul
fd
ffmpeg
fftw
figlet
file
filesystem
findutils
firefox
fish
flac
flashrom
flex
fontconfig
fontforge
freerdp
freetype2
fribidi
fuse-common
fuse2
fuse3
fwupd
fzf
gawk
gc
gcab
gcc
gcc-libs
gcr
gd
gdbm
gdk-pixbuf2
geoclue
geocode-glib
gettext
ghostscript
ghq-bin
giflib
girara
git
github-cli
glances
glew
glib-networking
glib2
glibc
glslang
glu
gmime3
gmp
gnu-free-fonts
gnu-netcat
gnupg
gnutls
go
gobject-introspection-runtime
google-chrome-beta
gpgme
gpm
gptfdisk
gradle
graphene
graphite
graphviz
grep
groff
gsettings-desktop-schemas
gsfonts
gsm
gst-libav
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gstreamer
gtk-update-icon-cache
gtk2
gtk3
gts
guile
gvfs
gzip
hancomoffice-hwpviewer
harfbuzz
harfbuzz-icu
hexyl
hicolor-icon-theme
hidapi
htop
httpie
hub
hunspell
hwids
hwloc
hyphen
iana-etc
icu
icu64
ijs
imagemagick
imlib2
inetutils
intel-ucode
iproute2
ipset
iptables
iputils
iso-codes
jack
jansson
jasper
java-environment-common
java-runtime-common
jbig2dec
jdk11-openjdk
jemalloc
jetbrains-toolbox
jq
jre-openjdk
jre-openjdk-headless
jre11-openjdk
jre11-openjdk-headless
js60
js68
json-c
json-glib
jsoncpp
kbd
keyutils
kmod
krb5
kyotocabinet
l-smash
lame
lcms2
ldb
ldns
less
lib32-acl
lib32-attr
lib32-bzip2
lib32-dbus
lib32-expat
lib32-faudio
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-gettext
lib32-glib2
lib32-glibc
lib32-glu
lib32-harfbuzz
lib32-icu
lib32-lcms2
lib32-libcap
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libgcrypt
lib32-libglvnd
lib32-libgpg-error
lib32-libice
lib32-libjpeg-turbo
lib32-libnl
lib32-libpcap
lib32-libpciaccess
lib32-libpng
lib32-libsm
lib32-libtiff
lib32-libunwind
lib32-libusb
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcursor
lib32-libxdamage
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxi
lib32-libxml2
lib32-libxrandr
lib32-libxrender
lib32-libxshmfence
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-lz4
lib32-mesa
lib32-ncurses
lib32-pcre
lib32-readline
lib32-sdl2
lib32-systemd
lib32-util-linux
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libabw
libaio
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libblockdev
libbluray
libbsd
libbytesize
libcaca
libcanberra
libcap
libcap-ng
libcddb
libcdio
libcdio-paranoia
libcdr
libcmis
libconfig
libcroco
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdrm
libdv
libdvdnav
libdvdread
libe-book
libedit
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexif
libexttextcat
libffi
libfm
libfm-extra
libfm-gtk2
libfontenc
libfreehand
libftdi
libgcrypt
libglvnd
libgpg-error
libgssglue
libgudev
libgusb
libhangul
libibus
libical
libice
libid3tag
libidn
libidn2
libiec61883
libimobiledevice
libindicator-gtk3
libinput
libixion
libjcat
libjpeg-turbo
libkeybinder3
libksba
liblangtag
libldap
liblqr
libluv
libmaxminddb
libmfx
libmicrohttpd
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmspub
libmwaw
libnet
libnetfilter_conntrack
libnetfilter_queue
libnfnetlink
libnftnl
libnghttp2
libnl
libnotify
libnsl
libnumbertext
libodfgen
libogg
libomxil-bellagio
liborcus
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpipeline
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqxp
libraqm
libraw1394
libreoffice-still
librevenge
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsm
libsmbios
libsndfile
libsodium
libsoup
libsoxr
libspectre
libspiro
libssh
libssh2
libstaroffice
libstemmer
libsynctex
libtasn1
libtermkey
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtorrent
libtorrent-rasterbar
libuninameslist
libunistring
libunwind
libusb
libusb-compat
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvdpau
libvisio
libvisual
libvncserver
libvorbis
libvpx
libvterm
libwacom
libwebp
libwpd
libwpg
libwps
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxls
libxml2
libxmlb
libxmu
libxpm
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxvmc
libxxf86vm
libyaml
libzip
libzmf
licenses
linux
linux-api-headers
linux-firmware
litecli
llvm-libs
lm_sensors
lmdb
lpsolve
lsof
lua
lua52
lua53
luajit
luarocks
lvm2
lxmenu-data
lz4
lzo
m4
mailcap
maim
make
man-db
man-pages
md4c
mdadm
menu-cache
mesa
minizip
mkinitcpio
mkinitcpio-busybox
mongodb-shell-bin
mongodb-tools
moreutils
mpfr
mpg123
mpv
msgpack-c
mtdev
mujs
mupdf
ncdu
ncurses
ndctl
neomutt
neon
net-tools
netctl
netpbm
netstandard-targeting-pack
nettle
ninja
nmap
nnn
nodejs
notmuch-runtime
noto-fonts
noto-fonts-cjk
noto-fonts-extra
npth
nspr
nss
oniguruma
openal
opencore-amr
openjpeg2
openmpi
openresolv
openssh
openssl
opus
orc
otf-ipafont
p11-kit
p7zip
pacman
pacman-mirrorlist
pam
pambase
pango
parallel
parted
patch
pavucontrol-qt
pciutils
pcmanfm
pcre
pcre2
pcsclite
peek
perl
perl-error
perl-io-tty
perl-ipc-run
perl-mailtools
perl-time-duration
perl-timedate
php
physlock
pinentry
pixman
pkgconf
pkgfile
polkit
poppler
popt
portaudio
potrace
procps-ng
psmisc
pueue-bin
pulseaudio
pulseaudio-alsa
pulseaudio-bluetooth
pygobject-devel
python
python-appdirs
python-asn1crypto
python-attrs
python-backports.csv
python-bcrypt
python-botocore
python-cached-property
python-cairo
python-cffi
python-chardet
python-cli_helpers
python-click
python-colorama
python-configobj
python-cryptography
python-dateutil
python-dbus
python-dbus-common
python-distro
python-docker
python-docker-pycreds
python-dockerpty
python-docopt
python-docutils
python-dotenv
python-future
python-gobject
python-idna
python-importlib-metadata
python-jmespath
python-jsonschema
python-ordered-set
python-packaging
python-paramiko
python-ply
python-prompt_toolkit
python-psutil
python-pyasn1
python-pycparser
python-pygments
python-pyinotify
python-pynacl
python-pyparsing
python-pyrsistent
python-requests
python-rsa
python-s3transfer
python-setuptools
python-six
python-sqlparse
python-systemd
python-tabulate
python-terminaltables
python-texttable
python-urllib3
python-wcwidth
python-websocket-client
python-yaml
python-zipp
qbittorrent
qbittorrent-nox
qt5-base
qt5-declarative
qt5-imageformats
qt5-script
qt5-svg
qt5-wayland
qt5-x11extras
radare2
ranger
raptor
rasqal
rav1e
readline
redis
redland
remmina
rest
rhash
ripgrep
rofi
rsync
rtkit
rtorrent
rubberband
ruby
ruby-irb
ruby-reline
rubygems
run-parts
runc
sbc
sc-im-git
scons
sd
sdl
sdl2
sed
shaderc
shadow
shared-mime-info
slock
slop
smartmontools
smbclient
snappy
sound-theme-freedesktop
spandsp
speex
speexdsp
spirv-tools
sqlite
sqlitebrowser
srt
startup-notification
stow
strace
sublime-merge
sudo
sxhkd
sxiv
syncthing
sysfsutils
systemd
systemd-libs
systemd-sysvcompat
taglib
talloc
tar
tdb
telegram-desktop
terminus-font
tevent
texinfo
thin-provisioning-tools
throttled
tig
tmux-git
tpm2-tss
trash-cli
tree-sitter
tslib
ttf-d2coding
ttf-nanum
twolame
tzdata
uchardet
udisks2
unibilium
unrar
unzip
upower
usbmuxd
util-linux
util-linux-libs
v4l-utils
vagrant
vamp-plugin-sdk
vid.stab
vim
vim-runtime
virtualbox
virtualbox-host-modules-arch
visual-studio-code-bin
vmaf
volume_key
vte-common
vte3
vulkan-icd-loader
wavpack
wayland
wayland-protocols
webkitgtk-bin
webrtc-audio-processing
wget
which
whois
wine
wireshark-cli
woff2
wpa_supplicant
x264
x265
xapian-core
xbitmaps
xcb-proto
xcb-util
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xclip
xdg-utils
xdo
xdotool
xf86-input-libinput
xf86-video-intel
xfsprogs
xkeyboard-config
xmlrpc-c
xmlsec
xorg-bdftopcf
xorg-font-util
xorg-font-utils
xorg-fonts-encodings
xorg-iceauth
xorg-luit
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xorgproto
xsel
xterm
xvidcore
xxhash
xz
yarn
yasm
yay
zathura
zathura-cb
zathura-djvu
zathura-pdf-mupdf
zathura-ps
zip
zita-alsa-pcmi
zita-resampler
zlib
zsh
zstd
