tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "automake"
brew "bash"
brew "bat"
brew "gettext"
brew "python@3.9"
brew "glib", link: false
brew "pkg-config"
brew "cmake"
brew "croc"
brew "curl"
brew "exa"
brew "fd"
brew "libtool"
brew "harfbuzz"
brew "fish"
brew "fzf"
brew "gawk"
brew "gcalcli"
brew "gcc"
brew "ghq"
brew "gnupg"
brew "helm"
brew "htop"
brew "hyperkit"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "lima"
brew "minikube"
brew "mpv"
brew "ninja"
brew "nmap"
brew "noti"
brew "openssh"
brew "pueue", restart_service: true
brew "ripgrep"
brew "scrcpy"
brew "sphinx-doc"
brew "sponge"
brew "stow"
brew "syncthing"
brew "telnet"
brew "ttyd"
brew "vifm", args: ["HEAD"]
brew "zlib"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alacritty"
cask "copyq"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "notion"
cask "obsidian"
cask "sublime-merge"
cask "tabby"
cask "telegram"
cask "vivaldi"
