tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "noahgorstein/tap"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "thecasualcoder/stable"
tap "wez/wezterm"
brew "act"
brew "age"
brew "brotli"
brew "giflib"
brew "imath"
brew "jpeg-turbo"
brew "libpng"
brew "libtiff"
brew "lz4"
brew "xz"
brew "zstd"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "libvmaf"
brew "aom"
brew "ca-certificates"
brew "apr-util"
brew "argocd"
brew "gettext"
brew "libssh2"
brew "aria2"
brew "gdbm"
brew "mpdecimal"
brew "python@3.10"
brew "asciinema"
brew "atool"
brew "m4"
brew "autoconf"
brew "automake"
brew "aws-iam-authenticator"
brew "six"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bdw-gc"
brew "berkeley-db"
brew "bkt"
brew "blueutil"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "broot"
brew "c-ares"
brew "caddy"
brew "freetype"
brew "fontconfig"
brew "pcre2"
brew "glib"
brew "libffi"
brew "pkg-config"
brew "libpthread-stubs"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pcre"
brew "pixman"
brew "cairo"
brew "hiredis"
brew "ccache"
brew "libnghttp2"
brew "libuv"
brew "node"
brew "cdk8s"
brew "terraform"
brew "cdktf"
brew "certbot"
brew "libtool"
brew "cfssl"
brew "choose-rust"
brew "cjson"
brew "cloc"
brew "cloudflared"
brew "cmake"
brew "cmatrix"
brew "cmocka"
brew "gmp"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libslirp"
brew "libssh"
brew "libusb"
brew "ncurses"
brew "guile"
brew "snappy"
brew "vde"
brew "qemu"
brew "lima"
brew "colima"
brew "coreutils"
brew "cpanminus"
brew "croc"
brew "libyaml"
brew "crystal"
brew "ctlptl"
brew "cunit"
brew "openldap"
brew "rtmpdump"
brew "curl", args: ["HEAD"]
brew "dav1d"
brew "deno"
brew "dhall"
brew "diff-so-fancy"
brew "diffr"
brew "diskus"
brew "dive"
brew "docbook"
brew "docbook-xsl"
brew "docker"
brew "docker-buildx"
brew "dog"
brew "duckdb"
brew "duti"
brew "eksctl"
brew "jansson"
brew "emacs"
brew "graphite2"
brew "harfbuzz"
brew "openjdk"
brew "emscripten"
brew "entr"
brew "envoy"
brew "etcd"
brew "exa"
brew "tcl-tk"
brew "expect"
brew "fd"
brew "libogg"
brew "flac"
brew "frei0r"
brew "fribidi"
brew "lame"
brew "openjpeg"
brew "leptonica"
brew "libb2"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "mbedtls"
brew "librist"
brew "libsamplerate"
brew "libvorbis"
brew "opus"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libvidstab"
brew "libvpx"
brew "opencore-amr"
brew "pango"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "speex"
brew "srt"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "zeromq"
brew "zimg"
brew "ffmpeg"
brew "ffmpeg@4"
brew "fish"
brew "fluent-bit", link: false
brew "flux"
brew "libspiro"
brew "libuninameslist"
brew "fontforge"
brew "libxfixes"
brew "libxdamage"
brew "libxi"
brew "libxrandr"
brew "libxxf86vm"
brew "mesa"
brew "freeglut"
brew "fzf"
brew "fzy"
brew "mpfr"
brew "gawk"
brew "gcalcli"
brew "isl"
brew "libmpc"
brew "gcc"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "jbig2dec"
brew "libidn"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-annex"
brew "git-delta"
brew "git-flow"
brew "git-lfs"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "gnu-sed"
brew "libcerf"
brew "lua"
brew "qt@5"
brew "gnuplot"
brew "go"
brew "gobject-introspection"
brew "goreleaser"
brew "jasper"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "gron"
brew "gumbo-parser"
brew "helm"
brew "hexyl"
brew "htop"
brew "hugo"
brew "hwatch"
brew "hyperfine"
brew "libde265"
brew "xmlto"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "libomp", link: true
brew "libraw"
brew "imagemagick"
brew "iproute2mac"
brew "istioctl"
brew "jc"
brew "jemalloc"
brew "jless"
brew "jo"
brew "jpeg"
brew "oniguruma"
brew "jq"
brew "json-c"
brew "just"
brew "k6"
brew "k9s"
brew "kafka"
brew "kakoune"
brew "kind"
brew "kompose"
brew "krb5"
brew "kubernetes-cli"
brew "krew"
brew "kubebuilder"
brew "kustomize"
brew "lazygit"
brew "ldns"
brew "lefthook"
brew "lf"
brew "libatomic_ops"
brew "libcbor"
brew "libev"
brew "libfido2"
brew "libgit2"
brew "libice"
brew "libiscsi"
brew "libmaxminddb"
brew "libpq"
brew "libsm"
brew "libsmi"
brew "unibilium"
brew "libtermkey"
brew "libtommath"
brew "yajl"
brew "libvirt"
brew "libvterm"
brew "libwebsockets"
brew "libxt"
brew "libxmu"
brew "llvm"
brew "llvm@11"
brew "python@3.9"
brew "llvm@12"
brew "llvm@13"
brew "lmdb"
brew "lnav"
brew "lsd"
brew "luajit"
brew "luajit-openresty"
brew "luarocks"
brew "luv"
brew "mbedtls@2"
brew "mdbook"
brew "mdzk"
brew "metis"
brew "minikube"
brew "protobuf"
brew "mitmproxy"
brew "mkcert"
brew "moarvm"
brew "moreutils"
brew "msgpack"
brew "mujs"
brew "multitail"
brew "mupdf"
brew "mysql"
brew "ncc"
brew "ncdu"
brew "talloc"
brew "xapian"
brew "notmuch"
brew "tokyo-cabinet"
brew "neomutt"
brew "tree-sitter"
brew "neovide"
brew "nghttp2"
brew "nginx"
brew "ninja"
brew "nmap"
brew "nnn"
brew "node_exporter"
brew "noti"
brew "nq"
brew "nqp"
brew "nspr"
brew "nss"
brew "openapi-generator"
brew "openblas"
brew "openjdk@11"
brew "openlibm"
brew "openssh"
brew "p7zip"
brew "pandoc"
brew "pastel"
brew "perl"
brew "pngpaste"
brew "podman"
brew "postgresql@14"
brew "prometheus"
brew "pstree"
brew "pueue", restart_service: true
brew "pulumi"
brew "rakudo"
brew "rancher-cli"
brew "ranger"
brew "rclone"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "rust-analyzer"
brew "rustscan"
brew "rustup-init"
brew "scc"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "sk"
brew "sloc"
brew "socat"
brew "sops"
brew "sphinx-doc"
brew "stern"
brew "stow"
brew "utf8proc"
brew "subversion"
brew "suite-sparse"
brew "telnet"
brew "terraformer"
brew "tig"
brew "tilt"
brew "tmux", args: ["HEAD"]
brew "trash-cli"
brew "tree"
brew "ttyd"
brew "uchardet"
brew "ugrep"
brew "unixodbc"
brew "vapoursynth"
brew "vbindiff"
brew "viddy"
brew "vifm"
brew "wallpaper"
brew "watch"
brew "websocat"
brew "wget"
brew "whalebrew"
brew "wrk"
brew "xclip"
brew "xonsh"
brew "xsel"
brew "yj"
brew "youtube-dl"
brew "zk"
brew "zoxide"
brew "zsh"
brew "koekeishiya/formulae/skhd", args: ["with-logging"]
brew "koekeishiya/formulae/yabai"
brew "noahgorstein/tap/jqp"
brew "thecasualcoder/stable/kube-fzf"
cask "alacritty"
cask "alfred"
cask "android-platform-tools"
cask "android-sdk"
cask "barrier"
cask "chromium"
cask "copyq"
cask "docker"
cask "firefox"
cask "font-sf-mono-nerd-font-ligaturized"
cask "hammerspoon"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "macfuse"
cask "microsoft-auto-update"
cask "mpv"
cask "obsidian"
cask "qutebrowser"
cask "tailscale"
cask "telegram"
cask "wezterm-nightly"
